core/src/main/resources/order_template/oc_charge.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loc="http://www.csapi.org/schema/parlayx/payment/reserve_amount_charging/v2_1/local">
   <soapenv:Header/>
   <soapenv:Body>
      <loc:chargeReservation>
         <loc:reservationIdentifier>{0}</loc:reservationIdentifier>
         <loc:charge>
            <description>{1}</description>
            <!--Optional:-->
            <currency>THB</currency>
            <!--Optional:-->
            <amount>{2}</amount>
            <!--Optional:-->
            <code>1</code>
         </loc:charge>
         <loc:referenceCode>{3}</loc:referenceCode>
      </loc:chargeReservation>
   </soapenv:Body>
</soapenv:Envelope>